EDT/УТ/src/Reports/ОтчетПоВесам_ПроцентВзвешенных/ОтчетПоВесам_ПроцентВзвешенных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВесам_ПроцентВзвешенных</name>
</mdclass:Report>

EDT/УТ/src/Catalogs/НастройкиАвтоматическойОтправкиОбщихОтчетов/НастройкиАвтоматическойОтправкиОбщихОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиАвтоматическойОтправкиОбщихОтчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Отчет</name>
    <type>
      <types>EnumRef.ВидыОтправляемыхОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаОтчета</name>
    <type>
      <types>EnumRef.ВидыПериодовАвтоматическогоФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериодаОтчета</name>
    <type>
      <types>EnumRef.ВидыПериодовАвтоматическогоФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОператорРассылки</name>
    <type>
      <types>CatalogRef.ОператорыСМСРассылки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАдресов</name>
    <attributes>
      <name>Отправлять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтрагентыИсключения</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтрагентыЦелевые</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Reports/ОтчетПоВесам_ПроцентВзвешенных/Forms/ФормаОтчетаУпр/Module.bsl
&НаКлиенте
Процедура ЗаписатьСписокИМВРассылку(Команда)
	
	СписокИМ = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ПравоеЗначение;
	
	Если СписокИМ.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
		ЭтотОбъект,СписокИМ);	
		
		ПоказатьВопрос(Оповещение,
		"Заполнить список Интернет Магазинов в Рассылке данным отбором?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Нет, // (необ.) кнопка по умолчанию
		"Внимание!!!" // (необ.) заголовок
		);    
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнениеСпискаИМРегламентированный(Параметры);
    КонецЕсли;	
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСпискаИМРегламентированный(СписокИМРег)
    СправОтчетПоВесам = Справочники.НастройкиАвтоматическойОтправкиОбщихОтчетов.НайтиПоКоду("00000000009");
	РедСпр = СправОтчетПоВесам.ПолучитьОбъект();
	РедСпр.КонтрагентыЦелевые.Очистить();
	
	Для Каждого Элем Из СписокИМРег Цикл
		НовСтр = РедСпр.КонтрагентыЦелевые.Добавить();
	    НовСтр.Контрагент = Элем.Значение;
	    НовСтр.Отметка = Истина;
	КонецЦикла;	
	
	РедСпр.Записать();
	
КонецПроцедуры
